onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КА_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КА_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КА_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	//Начало доработки
	//Коробка А.А. 10.08.2025
	// Добавлена инициализация скидки при создании документа
	Если Не ЗначениеЗаполнено(Объект.КА_СогласованнаяСкидка) Тогда
		Объект.КА_СогласованнаяСкидка = 0;
	КонецЕсли;
	//Конец доработки
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СогласованнаяСкидкаПриИзменении(Элемент)
	Оповещение = Новый ОписаниеОповещения("ОбработкаОтветаНаВопросОПересчетеСумм", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Пересчитать суммы с учетом новой скидки?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаНаВопросОПересчетеСумм(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПересчитатьСуммыСоСкидкой();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТабличныхЧастей

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	РассчитатьСуммуСтроки(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	РассчитатьСуммуСтроки(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	РассчитатьСуммуСтроки(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	РассчитатьСуммуСтроки(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	РассчитатьСуммуСтроки(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	РассчитатьСуммуСтроки(ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КЛ_ПересчитатьСуммыПосле(Команда)
	ПересчитатьСуммыСоСкидкой();
КонецПроцедуры

#КонецОбласти

#Область СерверныеПроцедуры

&НаСервере
Процедура РассчитатьСуммуДокументаНаСервере()
	Объект.СуммаДокумента = Окр(Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма"), 2);
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммыСоСкидкойНаСервере()
	Если Не ЗначениеЗаполнено(Объект.КА_СогласованнаяСкидка) Тогда
		Объект.КЛ_СогласованнаяСкидка = 0;
	КонецЕсли;
	
	// Пересчет товаров
	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		ОбщаяСкидка = Объект.КА_СогласованнаяСкидка + СтрокаТовары.Скидка;
		Если ОбщаяСкидка >= 100 Тогда
			СтрокаТовары.Сумма = 0;
		ИначеЕсли ОбщаяСкидка <= 0 Тогда
			СтрокаТовары.Сумма = Окр(СтрокаТовары.Цена * СтрокаТовары.Количество, 2);
		Иначе
			СтрокаТовары.Сумма = Окр(СтрокаТовары.Цена * СтрокаТовары.Количество * (1 - ОбщаяСкидка/100), 2);
		КонецЕсли;
	КонецЦикла;
	
	// Пересчет услуг
	Для Каждого СтрокаУслуги Из Объект.Услуги Цикл
		ОбщаяСкидка = Объект.КА_СогласованнаяСкидка + СтрокаУслуги.Скидка;
		Если ОбщаяСкидка >= 100 Тогда
			СтрокаУслуги.Сумма = 0;
		ИначеЕсли ОбщаяСкидка <= 0 Тогда
			СтрокаУслуги.Сумма = Окр(СтрокаУслуги.Цена * СтрокаУслуги.Количество, 2);
		Иначе
			СтрокаУслуги.Сумма = Окр(СтрокаУслуги.Цена * СтрокаУслуги.Количество * (1 - ОбщаяСкидка/100), 2);
		КонецЕсли;
	КонецЦикла;
	
	РассчитатьСуммуДокументаНаСервере();
КонецПроцедуры

#КонецОбласти

#Область КлиентскиеПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	РассчитатьСуммуДокументаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммыСоСкидкой()
	ПересчитатьСуммыСоСкидкойНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	Если ЗначениеЗаполнено(Объект.КА_СогласованнаяСкидка) Тогда
		ОбщаяСкидка = Объект.КА_СогласованнаяСкидка + ТекущиеДанные.Скидка;
		
		Если ОбщаяСкидка >= 100 Тогда
			ТекущиеДанные.Сумма = 0;
			Сообщить("Суммарная скидка достигла 100%. Сумма установлена в 0.", СтатусСообщения.Информация);
		ИначеЕсли ОбщаяСкидка <= 0 Тогда
			ТекущиеДанные.Сумма = Окр(ТекущиеДанные.Цена * ТекущиеДанные.Количество, 2);
		Иначе
			ТекущиеДанные.Сумма = Окр(ТекущиеДанные.Цена * ТекущиеДанные.Количество * (1 - ОбщаяСкидка/100), 2);
		КонецЕсли;
	Иначе
		Если ТекущиеДанные.Скидка >= 100 Тогда
			ТекущиеДанные.Сумма = 0;
			Сообщить("Скидка по строке достигла 100%. Сумма установлена в 0.", СтатусСообщения.Информация);
		ИначеЕсли ТекущиеДанные.Скидка <= 0 Тогда
			ТекущиеДанные.Сумма = Окр(ТекущиеДанные.Цена * ТекущиеДанные.Количество, 2);
		Иначе
			ТекущиеДанные.Сумма = Окр(ТекущиеДанные.Цена * ТекущиеДанные.Количество * (1 - ТекущиеДанные.Скидка/100), 2);
		КонецЕсли;
	КонецЕсли;
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти
